#include "cnix.h"
#include "type.h"
#include "stdlib.h"

/*****************************************************************
 		一个粗糙的延时函数
 ****************************************************************/
void timedelay(int time)
{
	int i, j, k;
	for(k=0; k<time; k++)
	{
		for(i=0; i<10; i++){
			for(j=0; j<100; j++){
			}
		}
	}
}

/*******************************************************************
 			清屏函数
 *******************************************************************/
void clear_screen()
{
	disPos = 0;
	int i = 0;
	while(i < 80*25)
	{
		prints(" ");
		i++;
	}
	disPos = 0;
}

/**********************************************************************
 		启动给定的IRQ中断
 **********************************************************************/
void enable_irq(int irq)
{
	/* 先从对应的端口中取出当前的OCW，然后将相应的位置为0并写回到相应的端口 */
	if(irq < 8)
	{
		write_port(0x21,read_port(0x21)&(~(1<<irq)));
	}else if(irq < 16){
		write_port(0xa1,read_port(0xa1)&(~(1<<irq)));
	}
}

/***********************************************************************
 		停止给定的IRQ中断
 ***********************************************************************/
void disable_irq(int irq)
{	
	/* 先从对应的端口中取出当前的OCW，然后将相应的位置为1并写回到相应的端口 */
	if(irq < 8)
	{
		write_port(0x21,read_port(0x21)|(1<<irq));
	}else if(irq < 16){
		write_port(0x21,read_port(0x21)|(1<<irq));
	}
}

/****************************************************************************
 			显示一个整数
 ****************************************************************************/
void printi(long num)
{
	char res[32];
	itoa(num,res,16);
	prints(res);
}

/*****************************************************************************
 			显示一个字符
 *****************************************************************************/
void printc(char c)
{
	char output[2];
	output[0] = c;
	output[1] = '\0';
	prints(output);
}

/*************************************************************************
 		将光标移动到特定的位置上
 *************************************************************************/
void cursor_mov(int pos)
{
	int_close();

	/* 控制光标首先向VGA寄存器中的地址寄存器中写寄存器的地址，这里的0x0E为Cursor High Location寄存器*/
	write_port(0x3D4,0x0E); 	//0x3D4，VGA地址寄存器
	
	/* 其次向VGA寄存器中的数据寄存器中写入光标的高字节位置*/
	write_port(0x3D5,((pos)>>8)&0xFF);	//0x3D5，VGA数据寄存器
	
	/* 控制光标首先向VGA寄存器中的地址寄存器中写寄存器的地址，这里的0x0F为Cursor Low Location寄存器*/
	write_port(0x3D4,0x0F);				
	
	write_port(0x3D5,(pos)&0xFF);	
	
	int_open();
}

/***************************************************************************
 		屏幕移动到特定位置上，这里操作屏幕的起始地址
 ***************************************************************************/
void screen_mov(int start_pos)
{
	int_close();

	/* 控制光标首先向VGA寄存器中的地址寄存器中写寄存器的地址，这里的0x0C为Address High Location寄存器*/
	write_port(0x3D4,0x0C); 	//0x3D4，VGA地址寄存器
	
	/* 其次向VGA寄存器中的数据寄存器中写入光标的高字节位置*/
	write_port(0x3D5,(start_pos>>8)&0xFF);	//0x3D5，VGA数据寄存器
	
	/* 控制光标首先向VGA寄存器中的地址寄存器中写寄存器的地址，这里的0x0F为Address Low Location寄存器*/
	write_port(0x3D4,0x0D);				
	
	write_port(0x3D5,start_pos&0xFF);	
	
	int_open();
}

